{
    "glav": "Негизги",
    "nashi": "Биздин курстар",
    "startButton": "Баштоо",
    "lesson": "Сабак",
    "repeat": "Кайталоо",
    "continue": "Улантуу",
    "example": "Мисалы:",
    "next": "Андан ары",
    "finish": "Бүттү",
    "support": "Колдоо",
    "ment": "Менторлор",
    "main": {
        "news": "Жаңылыктар",
        "settings": "Ырастоо"
    },
    "start": {
        "learnJava": "Келгиле, Java тилин нөлдөн баштап үйрөнөлү!",
        "ourCourse": "Биздин курс сизге Java программалоону абсолюттук нөлдөн баштап үйрөтөт. Сиз негизги принциптерди өздөштүрүп, тиркемелерди түзүүнү жана OOП түшүнүүнү үйрөнөсүз. Программалоо дүйнөсүнө кызыктуу сүңгүүгө даярданыңыз!",
        "whyJava": "Эмне үчүн Java?",
        "javaIs": "Java - дүйнө жүзү боюнча миңдеген иштеп чыгуучулар үчүн тандаган программалоо тили.",
        "universal": "Ар тараптуулук жана портативдүүлүк",
        "safety": "Ишенимдүүлүк жана коопсуздук",
        "library": "Чоң жамаат жана кеңири китепкана",
        "our": "Биздин",
        "ourCourse2": "Java нөлдөн баштап үйрөтөлү курсу",
        "unical": "уникалду артыкчылыктарды сунуштайт, бул сиздин окуу муктаждыктарыңыз үчүн эң сонун тандоо.",
        "deep": "Javaга терең сүңгүңүз",
        "practicSkill": "Практикалык тажрыйба",
        "graphic": "Ийкемдүү окуу графиги",
        "startLearn": "Окууну баштаңыз!"
    },
    "form": {
        "ifYouHaveQuestion": "Суроолоруңуз болсо, биз жардам беребиз",
        "saveYoureContacts": "Байланыш маалыматыңызды калтырыңыз, биз сиз менен байланышабыз",
        "name": "Аты жөнү",
        "rulse": "Мен маалымат тапшыруу эрежелерине макулмун",
        "consultation": "Консультацияны алуу"
    },
    "settings": {
        "standart": "Сайттын стандарттык версиясы",
        "font": "Шрифтти тандаңыз:",
        "interval": "Тамга аралыгы:",
        "middle": "ОРТО",
        "big": "ЧОҢ",
        "design": "Барак режими:",
        "brown": "КҮРӨҢ",
        "blue": "КӨК",
        "fontSize": "Арип өлчөмү:"
    },
    "ourCourses": {
        "web": "Java тилинде веб иштеп чыгуу",
        "mobile": "Мобилдик тиркемелерди иштеп чыгуу"
    },
    "lessonsList": {
        "programmCourse": "Курс программасы",
        "oop": "Объектке багытталган программалоону үйрөнүңүз",
        "getSkills": "Команданы өнүктүрүү боюнча тажрыйбага ээ болуңуз",
        "introduction": "Программалоого киришүү",
        "compleat": "бардык материалдардын",
        "all": "өтүлдү",
        "download": "Программаларды орнотуу.",
        "write": "Консоль киргизүү / жыйынтык"
    },
    "lessonPage": {
        "programming": "Программалоо – бул компьютердик программаларды түзүү жана өзгөртүү процесси. Компьютердик программа – бул компьютерге маселени чечүү үчүн берилген көрсөтмөлөрдүн жыйындысы.",
        "calculator": "Калькулятор – бул негизги арифметикалык амалдарды аткарууга мүмкүндүк берүүчү программа.",
        "whatsapp": "WhatsApp башка адамдар менен билдирүүлөрдү алмашууга мүмкүнчүлүк берет.",
        "google": "Сиз бул сайтка кирген Google Chrome - бул веб-баракчаларды көрүү үчүн иштелип чыккан программа.",
        "choose": "Программалоо тилдери ушул жана башка көптөгөн программаларды түзүү үчүн колдонулат. Программалоо тилин тандоо, адатта, сиз түзө турган программанын өзгөчөлүктөрүнө жараша болот."
    },
    "lang": "Java программалоо тили",
    "nabor": "Программалоо тили – бул компьютер буйруктарды (инструкцияларды) түшүнө турган жана аларды аткара турган белгилүү бир эрежелердин жыйындысы. Ар кандай программалоо тилиндеги программанын тексти программалык код деп аталат.",
    "onThisCourse": "Бул курста сиз Java тилинде программа жазууну үйрөнөсүз.",
    "javaThisMost": "Java – бул универсалдуу программалоо тили, ал көбүнчө веб-сайттарды жана смартфон тиркемелерин иштеп чыгуу үчүн колдонулат. Бул Java жардамы менен дүйнө жүзү боюнча кеңири белгилүү болгон көптөгөн программалык продуктылар түзүлгөн.",
    "minecraft": "Minecraft Java тилинде жазылган бир нече оюндардын бири болуп саналат;",
    "internet": "eBay жана Amazon онлайн дүкөндөрү;",
    "socts": "Социалдык тармактар: LinkedIn, Twitter, Facebook;",
    "pay": "PayPal төлөм системасы жана башкалар.",
    "krome": "Мындан тышкары, Android колдонмолорунун көбү ушул тилде жазылган, анткени Java аларды иштеп чыгуу үчүн дээрлик жалгыз тил.",
    "whyJava": "Эмне үчүн Java тилин үйрөнүү керек?",
    "javaNoobs": "Java үйрөнчүктөр үчүн ылайыктуу",
    "updated": "Java C жана C++ тилдеринен келип чыккан, алар бүгүнкү күндө да кеңири колдонулат. Бирок үйрөнчүктөр үчүн алда канча ыңгайлуу. Бул тилде программалоодо объектиге багытталган мамиле бар, ал жада калса жаңы иштеп чыгуучуларга тилди кыска убакыттын ичинде өздөштүрүүсүнө мүмкүндүк берет.",
    "after": "Javaдан кийин башка программалоо тилдерин үйрөнүү оңой",
    "pozvolaet": "Java башка тилдерди түшүнүүнү жеңилдетет. Эгер сиз англис тилин билсеңиз, анда Java тилин үйрөнүү кыйын болбойт, бул программалоо тилинин синтаксиси англис тилине окшош. Жана Java үйрөнгөндөн кийин башка тилдерди оңой өздөштүрө аласыз ​жана куралдар ачык жана жөнөкөй көрүнөт.",
    "javaHave": "Javaда чоң иштеп чыгуучулар коомчулугу бар",
    "nineths": "Java 90-жылдардан бери иштеп келе жатат, бул мезгилде сиздин чеберчилик деңгээлиңизге карабастан жардам берүүгө кубанычта болгон иштеп чыгуучулардын чоң онлайн коомчулугу түзүлдү. Oracle, JCP.org, Stack Overflow сыяктуу форумдарда жана сайттарда сиз Java өнүктүрүү боюнча керектүү суроолорду берип, кесипкөй жооп ала аласыз.",
    "moreCode": "Java тилинде жазылган көп код бар",
    "prichina": "2023-жылы Java тилин үйрөнүүнүн себебин Java тилинде көп код жазылганын жана келечекте кимдир бирөө бул кодду сактап, жаңыртып турушу керек деп эсептесе болот. Ошондуктан жумуш берүүчүлөргө Java программисттери керек болот. абдан узак убакыт бою.",
    "working": "Көпчүлүк ири компания долбоорлору Java иштейт",
    "more": "Көптөгөн белгилүү компаниялар Java колдонушат: Google, Yandex, Sberbank, Alfa Bank, VTB 24, Ebay, Amazon жана башкалар. Oracle маалыматы боюнча, Java дүйнө жүзү боюнча 3 миллиарддан ашык түзмөктөрдө иштейт - башка тилдерге караганда көбүрөөк. .",
    "vvedenie": "1. IT менен таанышуу",
    "langJava": "2.JAVA тили",
    "whyJavaMenu": "3.Эмне үчүн JAVA?"
}