{
    "glav": "Главная",
    "nashi": "Наши курсы",
    "startButton": "Начать",
    "lesson": "Урок",
    "repeat": "Повторить",
    "continue": "Продолжить",
    "next": "Дальше",
    "example": "Например:",
    "finish": "Завершить",
    "support": "Поддержка",
    "ment": "Менторы",
    "main": {
        "news": "Новости",
        "settings": "Настроить"
    },
    "start": {
        "learnJava": "Изучаем Java с нуля!",
        "ourCourse": "Наш курс обучит вас программированию на Java с абсолютного нуля. Вы освоите базовые принципы, научитесь создавать приложения и разберетесь с ООП. Подготовьтесь к захватывающему погружению в мир программирования!",
        "whyJava": "Почему Java?",
        "javaIs": "Java - язык программирования, который выбирают тысячи разработчиков по всему миру.",
        "universal": "Универсальность и Портативность",
        "safety": "Надежность и Безопасность",
        "library": "Большое сообщество и обширная библиотека",
        "our": "Наш курс",
        "ourCourse2": "Изучаем Java с нуля!",
        "unical": "предлагает уникальные преимущества, которые делают его отличным выбором для вашего обучения",
        "deep": "Глубокое Погружение в Java",
        "practicSkill": "Практический опыт",
        "graphic": "Гибкий График Обучения",
        "startLearn": "Начать обучение!"
    },
    "form": {
        "ifYouHaveQuestion": "Если у вас остались вопросы - мы поможем",
        "saveYoureContacts": "Оставьте свои контактные данные и мы свяжемся с вами",
        "name": "Имя",
        "rulse": "Согласен с правилами представления информации",
        "consultation": "Получить консультацию"
    },
    "settings": {
        "standart": "Стандартная версия сайта",
        "font": "Выберите шрифт:",
        "interval": "Интервал между буквами:",
        "middle": "СРЕДНИЙ",
        "big": "БОЛЬШОЙ",
        "design": "Режим страницы:",
        "brown": "КОРИЧНЕВЫЙ",
        "blue": "ГОЛУБОЙ",
        "fontSize": "Размер шрифта:"
    },
    "ourCourses": {
        "web": "Веб-разработка на Java",
        "mobile": "Разработка мобильных приложений"
    },
    "lessonsList": {
        "programmCourse": "Программа курса",
        "oop": "Изучите Обьектно Ориентированное Программирование",
        "getSkills": "Наберетесь опыта в командной разработке",
        "introduction": "Введение в программирование",
        "compleat": "пройдено",
        "all": "всего материала",
        "download": "Установка программ.",
        "write": "Консольный ввод / вывод"
    },
    "lessonPage": {
        "programming": "Программи́рование — процесс создания и модификации компьютерных программ. Компьютерная программа – это набор инструкций для решения компьютером какой-либо задачи.",
        "calculator": "Калькулятор – это программа, позволяющая производить элементарные арифметические операции.",
        "whatsapp": "Программа WhatsApp позволяет обмениваться сообщениями с другими людьми.",
        "google": "Google Chrome, через который вы скорее всего зашли на этот сайт, – это программа, предназначенная для просмотра веб-страниц.",
        "choose": "Для создания этих и многих других программ используются языки программирования. Выбор языка программирования, как правило, продиктован особенностями программы, которую вы собираетесь создать."
    },
    "lang": "Язык программирования Java",
    "nabor": "Язык программирования — набор определенных правил, по которым компьютер может понимать команды (инструкции) и выполнять их. Текст программы на любом языке программирования называется программным кодом.",
    "onThisCourse": "На этом курсе вы научитесь писать программы на языке Java.",
    "javaThisMost": "Java — это достаточно универсальный язык программирования, который часто используется для разработки сайтов и приложений для смартфонов. Именно с помощью Java были созданы многие программные продукты, широко известные во всём мире.",
    "minecraft": "Minecraft – одна из немногих игр, написанных на Java;",
    "internet": "Интернет - магазины eBay и Amazon;",
    "socts": "Социальные сети: LinkedIn, Twitter, Facebook;",
    "pay": "Платёжная система PayPal и многие другие.",
    "krome": "Кроме того, большинство Android - приложений были написаны на этом языке, так как Java — почти единственный язык для их разработки.",
    "whyJava": "Почему стоит изучать именно Java?",
    "javaNoobs": "Java подходит для новичков",
    "updated": "Java развился из языков C и C++, которые также широко используются сегодня. Но гораздо более удобный для начинающих. У этого языка объектно-ориентированный подход к программированию, который позволяет даже новеньким разработчикам в короткие сроки освоить язык.",
    "after": "После Java легко выучить другие языки программирования",
    "pozvolaet": "Java позволяет легко понимать другие языки. Если вы знаете английский язык, то освоить Java будет не трудно, синтаксис этого языка программирования похож на английский. А уже после выученного Java можно без проблем осваивать другие языки и инструменты. Они будут казаться понятными и простыми.",
    "javaHave": "У Java огромное сообщество разработчиков",
    "nineths": "Java существует с 90-х годов, за это время сформировалось огромное онлайн-сообщество разработчиков, которые рады помочь независимо от вашего уровня мастерства. На форумах и сайтах таких как Oracle, JCP.org, Stack Overflow можно задать все интересующие вас вопросы по разработке на Java. И получить профессиональный ответ.",
    "moreCode": "На Java уже написано много кода",
    "prichina": "Причиной для изучения Java в 2023 году можно считать тот факт, что на Java уже написано много кода, и кому-то нужно будет поддерживать и обновлять этот код в будущем. Поэтому работодателям нужны будут Java-программисты еще очень долго.",
    "working": "На Java работают большинство проектов крупных компаний",
    "more": "Многие известные компании используют Java: Google, Yandex, Сбербанк, Альфа Банк, ВТБ 24, Ebay, Amazon и другие. Согласно Oracle, Java работает на более чем 3 миллиардах устройств по всему миру – больше, чем на любом другом языке.",
    "vvedenie": "1. Введение в IT",
    "langJava": "2.Язык JAVA",
    "whyJavaMenu": "3.Почему JAVA?"
}